In [74]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# 1.Reading both the datasets

In [76]:
cs = pd.read_csv("unclean_customers.csv")
tn = pd.read_csv("unclean_transactions.csv")

In [77]:
cs.head()

,Customer ID,Gender,Age,City,Membership Type,Total Spend,Items Purchased,Average Rating,Discount Applied,Satisfaction Level
0,17850.0,NaN,29.0,Los Angeles,Gold,8044.27,443.0,3.07,False,Neutral
1,13047.0,Female,NaN,Houston,Silver,7393.19,415.0,3.29,False,Neutral
2,12583.0,Male,56.0,NaN,NaN,3043.45,395.0,1.52,False,NaN
3,13748.0,NaN,26.0,Miami,Silver,679.77,134.0,4.36,False,Satisfied
4,15100.0,Male,52.0,Los Angeles,Bronze,1511.31,NaN,4.15,NaN,Neutral

In [78]:
cs.shape

(4372, 10)

In [79]:
tn.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6.0,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6.0,12/1/2010 8:26,3.39,17850.0,NaN
2,NaN,NaN,CREAM CUPID HEARTS COAT HANGER,NaN,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6.0,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6.0,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [80]:
tn.shape

(541909, 8)

# 2.Exploring and Cleaning

## Customer Dataset

In [82]:
cs.head()

,Customer ID,Gender,Age,City,Membership Type,Total Spend,Items Purchased,Average Rating,Discount Applied,Satisfaction Level
0,17850.0,NaN,29.0,Los Angeles,Gold,8044.27,443.0,3.07,False,Neutral
1,13047.0,Female,NaN,Houston,Silver,7393.19,415.0,3.29,False,Neutral
2,12583.0,Male,56.0,NaN,NaN,3043.45,395.0,1.52,False,NaN
3,13748.0,NaN,26.0,Miami,Silver,679.77,134.0,4.36,False,Satisfied
4,15100.0,Male,52.0,Los Angeles,Bronze,1511.31,NaN,4.15,NaN,Neutral

In [83]:
cs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4372 entries, 0 to 4371
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         3935 non-null   float64
 1   Gender              3961 non-null   object
 2   Age                 3935 non-null   float64
 3   City                3964 non-null   object
 4   Membership Type     3956 non-null   object
 5   Total Spend         3935 non-null   float64
 6   Items Purchased     3935 non-null   float64
 7   Average Rating      3935 non-null   float64
 8   Discount Applied    3935 non-null   object
 9   Satisfaction Level  3961 non-null   object
dtypes: float64(5), object(5)
memory usage: 341.7+ KB

Null values are there so lets check

### Treating Null

In [85]:
(cs.isnull().sum()/len(cs))*100

Customer ID           9.995425
Gender                9.400732
Age                   9.995425
City                  9.332113
Membership Type       9.515096
Total Spend           9.995425
Items Purchased       9.995425
Average Rating        9.995425
Discount Applied      9.995425
Satisfaction Level    9.400732
dtype: float64

Every column here is having null values of around 10% so it's not logical to drop the column instead we can try to impute it . If the null percentage of any column is greater than 30 % or so , we would have dropped that column. But we need to drop the null in the column Customer id.

In [87]:
#percentage of data remaining after dropping nan in customer id
(cs.dropna(subset=['Customer ID']).shape[0]/cs.shape[0])*100

90.00457456541628

In [88]:
cs = cs.dropna(subset=['Customer ID'])
cs.shape

(3935, 10)

In [152]:
# changing Customer ID datatype to interger
cs['Customer ID'] = cs['Customer ID'].astype('object')

In [90]:
cs.columns

Index(['Customer ID', 'Gender', 'Age', 'City', 'Membership Type',
       'Total Spend', 'Items Purchased', 'Average Rating', 'Discount Applied',
       'Satisfaction Level'],
      dtype='object')

In [106]:
# separating them into numeric and categorical
categ_cols = ['Gender', 'Membership Type','Discount Applied','Satisfaction Level','City']
for cols in categ_cols:
    cs[cols] = cs[cols].fillna(cs[cols].mode()[0])

numerical_cols = ['Age', 'Total Spend', 'Items Purchased', 'Average Rating']
for col in numerical_cols:
    cs[col] = cs[col].fillna(cs[col].median())

In [108]:
# considerin every numeric separately
cs['Age'] = cs['Age'].astype(int) # age can not be float

In [112]:
cs.isnull().sum()

Customer ID           0
Gender                0
Age                   0
City                  0
Membership Type       0
Total Spend           0
Items Purchased       0
Average Rating        0
Discount Applied      0
Satisfaction Level    0
dtype: int64

### Treating Duplicates

In [122]:
# check for customer duplicated
cs.duplicated().sum()

0

In [120]:
cs.duplicated().sum(axis=0)

0

No duplicates are there .

In [128]:
cs.sample(10)
cs.shape

(3935, 10)

So the Customer dataset looks clean to proceed further.

## Transaction dataset

In [130]:
tn.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6.0,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6.0,12/1/2010 8:26,3.39,17850.0,NaN
2,NaN,NaN,CREAM CUPID HEARTS COAT HANGER,NaN,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6.0,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6.0,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [132]:
tn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    487718 non-null  object
 1   StockCode    487718 non-null  object
 2   Description  486422 non-null  object
 3   Quantity     487718 non-null  float64
 4   InvoiceDate  487718 non-null  object
 5   UnitPrice    487718 non-null  float64
 6   CustomerID   366338 non-null  float64
 7   Country      487718 non-null  object
dtypes: float64(3), object(5)
memory usage: 33.1+ MB

### Null Values treatment

In [134]:
tn.isnull().sum()

InvoiceNo       54191
StockCode       54191
Description     55487
Quantity        54191
InvoiceDate     54191
UnitPrice       54191
CustomerID     175571
Country         54191
dtype: int64

In [140]:
tn = tn.dropna(subset=['CustomerID'])
tn['CustomerID'] = tn['CustomerID'].astype('object')

In [150]:
(tn.isnull().sum()/tn.shape[0])*100

InvoiceNo       9.941912
StockCode      10.042911
Description     9.988863
Quantity        9.975487
InvoiceDate    10.003876
UnitPrice      10.007698
CustomerID      0.000000
Country         9.995141
dtype: float64

In [164]:
tn = tn.drop(columns = ['Country'])

In [166]:
tn.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID'],
      dtype='object')

In [174]:
# considering each col separatelhy
tn = tn.dropna(subset=['InvoiceNo','InvoiceDate'])

# categorical columns
catg_cols = ['Description','StockCode']
for col in ['Description', 'StockCode']:
    tn[col] = tn[col].fillna(tn[col].mode()[0])

# numerical columns
num_col = ['Quantity','UnitPrice']
for cols in num_col:
    tn[cols] = tn[cols].fillna(tn[cols].mode()[0])

In [176]:
tn.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
dtype: int64